print("Wellcom to place the Rabbite🥕🐰")
print("""
['☘️'],['☘️'],['☘️']
['☘️'],['☘️'],['☘️']
['☘️'],['☘️'],['☘️']
""")
what= input("Where do you want to place the Rabbite?:  ")
if what == "11":
    print("""
['🐰'],['☘️'],['☘️']
['☘️'],['☘️'],['☘️']
['☘️'],['☘️'],['☘️']
         """)
elif what == "12":
    print("""
['☘️'],['🐰'],['☘️']
['☘️'],['☘️'],['☘️']
['☘️'],['☘️'],['☘️']
         """)
elif what == "13":
    print("""
['☘️'],['☘️'],['🐰']
['☘️'],['☘️'],['☘️']
['☘️'],['☘️'],['☘️']
         """)
elif what == "21":
    print("""
['☘️'],['☘️'],['☘️']
['🐰'],['☘️'],['☘️']
['☘️'],['☘️'],['☘️']
         """)
elif what == "22":
    print("""
['☘️'],['☘️'],['☘️']
['☘️'],['🐰'],['☘️']
['☘️'],['☘️'],['☘️']
         """)
elif what == "23":
    print("""
['☘️'],['☘️'],['☘️']
['☘️'],['☘️'],['🐰']
['☘️'],['☘️'],['☘️']
         """)
elif what == "31":
    print("""
['☘️'],['☘️'],['☘️']
['☘️'],['☘️'],['☘️']
['🐰'],['☘️'],['☘️']
         """)
elif what == "32":
    print("""
['☘️'],['☘️'],['☘️']
['☘️'],['☘️'],['☘️']
['☘️'],['🐰'],['☘️']
         """)
elif what == "33":
    print("""
['☘️'],['☘️'],['☘️']
['☘️'],['☘️'],['☘️']
['☘️'],['☘️'],['🐰']
         """)
else:
    print("Please enter the place where you want the rabbit to be🐇")